; domain
;; Enrico Scala (enricos83@gmail.com)
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
;;; counters-ineq-rnd domain, functional strips version
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
;;; This domain describes a set of counters that can be increased and decreased. The rate of such counter is however variable!

(define (domain fo-counters-rnd)
    (:requirements :strips :typing :fluents :adl)
    (:types counter)

    (:functions
        (value ?c - counter);; - int  ;; The value shown in counter ?c
        (rate_value ?c - counter);;
        (max_int);; -  int ;; The maximum integer we consider - a static value
    )

    ;; Increment the value in the given counter by one
    (:action increment
         :parameters (?c - counter)
         :precondition (and (<= (+ (value ?c) (rate_value ?c)) (max_int)))
         :effect (and (increase (value ?c) (rate_value ?c)))
    )
    ;; Decrement the value in the given counter by one
    (:action decrement
         :parameters (?c - counter)
         :precondition (and (>= (- (value ?c) (rate_value ?c)) 0))
         :effect (and (decrease (value ?c) (rate_value ?c)))
    )

    (:action increase_rate
         :parameters (?c - counter)
         :precondition (and (<= (+ (rate_value ?c) 1) 10))
         :effect (and (increase (rate_value ?c) 1))
    )

    (:action decrement_rate
         :parameters (?c - counter)
         :precondition (and (>= (rate_value ?c) 1))
         :effect (and (decrease (rate_value ?c) 1))
    )


)

; problem
;; Enrico Scala (enricos83@gmail.com) and Miquel Ramirez (miquel.ramirez@gmail.com)
(define (problem instance_12_100)
	(:domain fo-counters-rnd)
	(:objects
		c0 c1 c2 c3 c4 c5 c6 c7 c8 c9 c10 c11 - counter
	)
  (:init
		(= (value c0) 70)
	(= (value c1) 94)
	(= (value c2) 0)
	(= (value c3) 24)
	(= (value c4) 26)
	(= (value c5) 68)
	(= (value c6) 69)
	(= (value c7) 85)
	(= (value c8) 28)
	(= (value c9) 33)
	(= (value c10) 0)
	(= (value c11) 83)

        (= (rate_value c0) 0)
	(= (rate_value c1) 0)
	(= (rate_value c2) 0)
	(= (rate_value c3) 0)
	(= (rate_value c4) 0)
	(= (rate_value c5) 0)
	(= (rate_value c6) 0)
	(= (rate_value c7) 0)
	(= (rate_value c8) 0)
	(= (rate_value c9) 0)
	(= (rate_value c10) 0)
	(= (rate_value c11) 0)

		(= (max_int) 100)
	)
	(:goal
		(and
			(<= (+ (value c0) 1) (value c1))
	(<= (+ (value c1) 1) (value c2))
	(<= (+ (value c2) 1) (value c3))
	(<= (+ (value c3) 1) (value c4))
	(<= (+ (value c4) 1) (value c5))
	(<= (+ (value c5) 1) (value c6))
	(<= (+ (value c6) 1) (value c7))
	(<= (+ (value c7) 1) (value c8))
	(<= (+ (value c8) 1) (value c9))
	(<= (+ (value c9) 1) (value c10))
	(<= (+ (value c10) 1) (value c11))
		)
	)
)

; plan
1. (increase_rate c10)
   changed: (rate_value c10) from 0 to 1
   goals met: 8 of 11
2. (increase_rate c10)
   changed: (rate_value c10) from 1 to 2
   goals met: 8 of 11
3. (increase_rate c10)
   changed: (rate_value c10) from 2 to 3
   goals met: 8 of 11
4. (increase_rate c10)
   changed: (rate_value c10) from 3 to 4
   goals met: 8 of 11
5. (increase_rate c10)
   changed: (rate_value c10) from 4 to 5
   goals met: 8 of 11
6. (increase_rate c8)
   changed: (rate_value c8) from 0 to 1
   goals met: 8 of 11
7. (increase_rate c8)
   changed: (rate_value c8) from 1 to 2
   goals met: 8 of 11
8. (increase_rate c8)
   changed: (rate_value c8) from 2 to 3
   goals met: 8 of 11
9. (increase_rate c8)
   changed: (rate_value c8) from 3 to 4
   goals met: 8 of 11
10. (increase_rate c8)
   changed: (rate_value c8) from 4 to 5
   goals met: 8 of 11
11. (increase_rate c8)
   changed: (rate_value c8) from 5 to 6
   goals met: 8 of 11
12. (increase_rate c8)
   changed: (rate_value c8) from 6 to 7
   goals met: 8 of 11
13. (increase_rate c10)
   changed: (rate_value c10) from 5 to 6
   goals met: 8 of 11
14. (increase_rate c10)
   changed: (rate_value c10) from 6 to 7
   goals met: 8 of 11
15. (increment c10)
   changed: (value c10) from 0 to 7
   goals met: 8 of 11
16. (increase_rate c9)
   changed: (rate_value c9) from 0 to 1
   goals met: 8 of 11
17. (increase_rate c9)
   changed: (rate_value c9) from 1 to 2
   goals met: 8 of 11
18. (increment c10)
   changed: (value c10) from 7 to 14
   goals met: 8 of 11
19. (increment c10)
   changed: (value c10) from 14 to 21
   goals met: 8 of 11
20. (increment c10)
   changed: (value c10) from 21 to 28
   goals met: 8 of 11
21. (increment c10)
   changed: (value c10) from 28 to 35
   goals met: 9 of 11
22. (increase_rate c8)
   changed: (rate_value c8) from 7 to 8
   goals met: 9 of 11
23. (increase_rate c8)
   changed: (rate_value c8) from 8 to 9
   goals met: 9 of 11
24. (increment c8)
   changed: (value c8) from 28 to 37
   goals met: 8 of 11
25. (increment c8)
   changed: (value c8) from 37 to 46
   goals met: 8 of 11
26. (increment c8)
   changed: (value c8) from 46 to 55
   goals met: 8 of 11
27. (increase_rate c8)
   changed: (rate_value c8) from 9 to 10
   goals met: 8 of 11
28. (increment c8)
   changed: (value c8) from 55 to 65
   goals met: 8 of 11
29. (increase_rate c9)
   changed: (rate_value c9) from 2 to 3
   goals met: 8 of 11
30. (increase_rate c9)
   changed: (rate_value c9) from 3 to 4
   goals met: 8 of 11
31. (increment c9)
   changed: (value c9) from 33 to 37
   goals met: 7 of 11
32. (increment c10)
   changed: (value c10) from 35 to 42
   goals met: 8 of 11
33. (increase_rate c9)
   changed: (rate_value c9) from 4 to 5
   goals met: 8 of 11
34. (increment c9)
   changed: (value c9) from 37 to 42
   goals met: 7 of 11
35. (increment c9)
   changed: (value c9) from 42 to 47
   goals met: 7 of 11
36. (increment c9)
   changed: (value c9) from 47 to 52
   goals met: 7 of 11
37. (increment c10)
   changed: (value c10) from 42 to 49
   goals met: 7 of 11
38. (increment c10)
   changed: (value c10) from 49 to 56
   goals met: 8 of 11
39. (increase_rate c2)
   changed: (rate_value c2) from 0 to 1
   goals met: 8 of 11
40. (increase_rate c2)
   changed: (rate_value c2) from 1 to 2
   goals met: 8 of 11
41. (increase_rate c2)
   changed: (rate_value c2) from 2 to 3
   goals met: 8 of 11
42. (increase_rate c2)
   changed: (rate_value c2) from 3 to 4
   goals met: 8 of 11
43. (increase_rate c2)
   changed: (rate_value c2) from 4 to 5
   goals met: 8 of 11
44. (increase_rate c2)
   changed: (rate_value c2) from 5 to 6
   goals met: 8 of 11
45. (increase_rate c2)
   changed: (rate_value c2) from 6 to 7
   goals met: 8 of 11
46. (increase_rate c2)
   changed: (rate_value c2) from 7 to 8
   goals met: 8 of 11
47. (increment c2)
   changed: (value c2) from 0 to 8
   goals met: 8 of 11
48. (increase_rate c2)
   changed: (rate_value c2) from 8 to 9
   goals met: 8 of 11
49. (increment c2)
   changed: (value c2) from 8 to 17
   goals met: 8 of 11
50. (increment c2)
   changed: (value c2) from 17 to 26
   goals met: 7 of 11
51. (increment c2)
   changed: (value c2) from 26 to 35
   goals met: 7 of 11
52. (increase_rate c3)
   changed: (rate_value c3) from 0 to 1
   goals met: 7 of 11
53. (increment c2)
   changed: (value c2) from 35 to 44
   goals met: 7 of 11
54. (increase_rate c3)
   changed: (rate_value c3) from 1 to 2
   goals met: 7 of 11
55. (increment c2)
   changed: (value c2) from 44 to 53
   goals met: 7 of 11
56. (increment c2)
   changed: (value c2) from 53 to 62
   goals met: 7 of 11
57. (increase_rate c1)
   changed: (rate_value c1) from 0 to 1
   goals met: 7 of 11
58. (increase_rate c1)
   changed: (rate_value c1) from 1 to 2
   goals met: 7 of 11
59. (increase_rate c3)
   changed: (rate_value c3) from 2 to 3
   goals met: 7 of 11
60. (increase_rate c3)
   changed: (rate_value c3) from 3 to 4
   goals met: 7 of 11
61. (increase_rate c3)
   changed: (rate_value c3) from 4 to 5
   goals met: 7 of 11
62. (increment c2)
   changed: (value c2) from 62 to 71
   goals met: 7 of 11
63. (increase_rate c7)
   changed: (rate_value c7) from 0 to 1
   goals met: 7 of 11
64. (increment c9)
   changed: (value c9) from 52 to 57
   goals met: 6 of 11
65. (increment c10)
   changed: (value c10) from 56 to 63
   goals met: 7 of 11
66. (increment c9)
   changed: (value c9) from 57 to 62
   goals met: 7 of 11
67. (increment c8)
   changed: (value c8) from 65 to 75
   goals met: 7 of 11
68. (increase_rate c3)
   changed: (rate_value c3) from 5 to 6
   goals met: 7 of 11
69. (increase_rate c3)
   changed: (rate_value c3) from 6 to 7
   goals met: 7 of 11
70. (increase_rate c2)
   changed: (rate_value c2) from 9 to 10
   goals met: 7 of 11
71. (increment c3)
   changed: (value c3) from 24 to 31
   goals met: 6 of 11
72. (increment c3)
   changed: (value c3) from 31 to 38
   goals met: 6 of 11
73. (increase_rate c3)
   changed: (rate_value c3) from 7 to 8
   goals met: 6 of 11
74. (increase_rate c3)
   changed: (rate_value c3) from 8 to 9
   goals met: 6 of 11
75. (increase_rate c3)
   changed: (rate_value c3) from 9 to 10
   goals met: 6 of 11
76. (increase_rate c4)
   changed: (rate_value c4) from 0 to 1
   goals met: 6 of 11
77. (increase_rate c4)
   changed: (rate_value c4) from 1 to 2
   goals met: 6 of 11
78. (increase_rate c4)
   changed: (rate_value c4) from 2 to 3
   goals met: 6 of 11
79. (increase_rate c1)
   changed: (rate_value c1) from 2 to 3
   goals met: 6 of 11
80. (increase_rate c1)
   changed: (rate_value c1) from 3 to 4
   goals met: 6 of 11
81. (increase_rate c1)
   changed: (rate_value c1) from 4 to 5
   goals met: 6 of 11
82. (decrement c1)
   changed: (value c1) from 94 to 89
   goals met: 6 of 11
83. (decrement c1)
   changed: (value c1) from 89 to 84
   goals met: 6 of 11
84. (decrement c1)
   changed: (value c1) from 84 to 79
   goals met: 6 of 11
85. (decrement c1)
   changed: (value c1) from 79 to 74
   goals met: 6 of 11
86. (decrement c1)
   changed: (value c1) from 74 to 69
   goals met: 6 of 11
87. (increment c4)
   changed: (value c4) from 26 to 29
   goals met: 6 of 11
88. (increment c1)
   changed: (value c1) from 69 to 74
   goals met: 6 of 11
89. (decrement c3)
   changed: (value c3) from 38 to 28
   goals met: 7 of 11
90. (decrement c2)
   changed: (value c2) from 71 to 61
   goals met: 7 of 11
91. (increment c9)
   changed: (value c9) from 62 to 67
   goals met: 6 of 11
92. (increment c10)
   changed: (value c10) from 63 to 70
   goals met: 7 of 11
93. (increment c9)
   changed: (value c9) from 67 to 72
   goals met: 6 of 11
94. (increment c10)
   changed: (value c10) from 70 to 77
   goals met: 7 of 11
95. (increment c9)
   changed: (value c9) from 72 to 77
   goals met: 7 of 11
96. (increment c10)
   changed: (value c10) from 77 to 84
   goals met: 7 of 11
97. (increment c8)
   changed: (value c8) from 75 to 85
   goals met: 6 of 11
98. (decrement c10)
   changed: (value c10) from 84 to 77
   goals met: 6 of 11
99. (decrement c9)
   changed: (value c9) from 77 to 72
   goals met: 7 of 11
100. (decrement c7)
   changed: (value c7) from 85 to 84
   goals met: 8 of 11
101. (increment c9)
   changed: (value c9) from 72 to 77
   goals met: 7 of 11
102. (increment c10)
   changed: (value c10) from 77 to 84
   goals met: 7 of 11
103. (increment c9)
   changed: (value c9) from 77 to 82
   goals met: 7 of 11
104. (increment c9)
   changed: (value c9) from 82 to 87
   goals met: 7 of 11
105. (increment c10)
   changed: (value c10) from 84 to 91
   goals met: 8 of 11
106. (increase_rate c10)
   changed: (rate_value c10) from 7 to 8
   goals met: 8 of 11
107. (increase_rate c10)
   changed: (rate_value c10) from 8 to 9
   goals met: 8 of 11
108. (increment c3)
   changed: (value c3) from 28 to 38
   goals met: 7 of 11
109. (increment c4)
   changed: (value c4) from 29 to 32
   goals met: 7 of 11
110. (increment c4)
   changed: (value c4) from 32 to 35
   goals met: 7 of 11
111. (increment c4)
   changed: (value c4) from 35 to 38
   goals met: 7 of 11
112. (increment c4)
   changed: (value c4) from 38 to 41
   goals met: 8 of 11
113. (increment c2)
   changed: (value c2) from 61 to 71
   goals met: 8 of 11
114. (decrement c1)
   changed: (value c1) from 74 to 69
   goals met: 8 of 11
115. (increment c3)
   changed: (value c3) from 38 to 48
   goals met: 7 of 11
116. (increment c4)
   changed: (value c4) from 41 to 44
   goals met: 7 of 11
117. (increment c4)
   changed: (value c4) from 44 to 47
   goals met: 7 of 11
118. (increment c4)
   changed: (value c4) from 47 to 50
   goals met: 8 of 11
119. (increment c1)
   changed: (value c1) from 69 to 74
   goals met: 8 of 11
120. (increment c2)
   changed: (value c2) from 71 to 81
   goals met: 9 of 11
121. (increment c3)
   changed: (value c3) from 48 to 58
   goals met: 8 of 11
122. (increment c4)
   changed: (value c4) from 50 to 53
   goals met: 8 of 11
123. (increment c4)
   changed: (value c4) from 53 to 56
   goals met: 8 of 11
124. (increment c4)
   changed: (value c4) from 56 to 59
   goals met: 9 of 11
125. (decrement c2)
   changed: (value c2) from 81 to 71
   goals met: 8 of 11
126. (decrement c1)
   changed: (value c1) from 74 to 69
   goals met: 8 of 11
127. (decrement c2)
   changed: (value c2) from 71 to 61
   goals met: 7 of 11
128. (decrement c1)
   changed: (value c1) from 69 to 64
   goals met: 7 of 11
129. (increase_rate c1)
   changed: (rate_value c1) from 5 to 6
   goals met: 7 of 11
130. (increase_rate c0)
   changed: (rate_value c0) from 0 to 1
   goals met: 7 of 11
131. (increment c2)
   changed: (value c2) from 61 to 71
   goals met: 8 of 11
132. (increment c1)
   changed: (value c1) from 64 to 70
   goals met: 8 of 11
133. (decrement c0)
   changed: (value c0) from 70 to 69
   goals met: 9 of 11
134. (decrement c10)
   changed: (value c10) from 91 to 82
   goals met: 9 of 11
135. (decrement c9)
   changed: (value c9) from 87 to 82
   goals met: 8 of 11
136. (decrement c9)
   changed: (value c9) from 82 to 77
   goals met: 9 of 11
137. (decrement c8)
   changed: (value c8) from 85 to 75
   goals met: 9 of 11
138. (decrement c7)
   changed: (value c7) from 84 to 83
   goals met: 9 of 11
139. (decrement c7)
   changed: (value c7) from 83 to 82
   goals met: 9 of 11
140. (decrement c7)
   changed: (value c7) from 82 to 81
   goals met: 9 of 11
141. (decrement c7)
   changed: (value c7) from 81 to 80
   goals met: 9 of 11
142. (decrement c7)
   changed: (value c7) from 80 to 79
   goals met: 9 of 11
143. (decrement c7)
   changed: (value c7) from 79 to 78
   goals met: 9 of 11
144. (decrement c7)
   changed: (value c7) from 78 to 77
   goals met: 9 of 11
145. (decrement c7)
   changed: (value c7) from 77 to 76
   goals met: 9 of 11
146. (decrement c7)
   changed: (value c7) from 76 to 75
   goals met: 9 of 11
147. (decrement c7)
   changed: (value c7) from 75 to 74
   goals met: 10 of 11
148. (increment c3)
   changed: (value c3) from 58 to 68
   goals met: 9 of 11
149. (increment c4)
   changed: (value c4) from 59 to 62
   goals met: 9 of 11
150. (increment c4)
   changed: (value c4) from 62 to 65
   goals met: 9 of 11
151. (increment c4)
   changed: (value c4) from 65 to 68
   goals met: 8 of 11
152. (increment c4)
   changed: (value c4) from 68 to 71
   goals met: 9 of 11
153. (increase_rate c4)
   changed: (rate_value c4) from 3 to 4
   goals met: 9 of 11
154. (decrement c2)
   changed: (value c2) from 71 to 61
   goals met: 9 of 11
155. (decrement c1)
   changed: (value c1) from 70 to 64
   goals met: 8 of 11
156. (decrement c1)
   changed: (value c1) from 64 to 58
   goals met: 9 of 11
157. (increase_rate c0)
   changed: (rate_value c0) from 1 to 2
   goals met: 9 of 11
158. (increase_rate c0)
   changed: (rate_value c0) from 2 to 3
   goals met: 9 of 11
159. (increase_rate c0)
   changed: (rate_value c0) from 3 to 4
   goals met: 9 of 11
160. (decrement c0)
   changed: (value c0) from 69 to 65
   goals met: 9 of 11
161. (decrement c0)
   changed: (value c0) from 65 to 61
   goals met: 9 of 11
162. (decrement c0)
   changed: (value c0) from 61 to 57
   goals met: 10 of 11
163. (decrement c4)
   changed: (value c4) from 71 to 67
   goals met: 10 of 11
164. (decrement c3)
   changed: (value c3) from 68 to 58
   goals met: 10 of 11
165. (decrement c2)
   changed: (value c2) from 61 to 51
   goals met: 10 of 11
166. (decrement c1)
   changed: (value c1) from 58 to 52
   goals met: 9 of 11
167. (decrement c1)
   changed: (value c1) from 52 to 46
   goals met: 10 of 11
168. (decrement c0)
   changed: (value c0) from 57 to 53
   goals met: 10 of 11
169. (decrement c0)
   changed: (value c0) from 53 to 49
   goals met: 10 of 11
170. (decrement c0)
   changed: (value c0) from 49 to 45
   goals met: 11 of 11
